export default {
  gl: {
    image: "صورة",
    next: "التالي",
    back: "عودة",
    done: "تم",
    cancel: "إلغاء",
    add: "إضافة",
    lessons: ["درس", "درسين", "دروس"],
    lesson: "الدرس",
    time: {
      pm: "مساءً",
      am: "صباحاً",
    },
    week: [
      "الأحد",
      "الإثنين",
      "الثلاثاء",
      "الأربعاء",
      "الخميس",
      "الجمعة",
      "السبت",
    ],
    days: ["يوم", "يومين", "أيام"],
    or: "أو",
    form: {
      email: "البريد الإلكتروني",
    },
    msg: {
      save: "تم الحفظ بنجاح",
      error: {
        sendData:
          "تعذر إرسال البيانات للخادم, يرجى الاتصال بالإنترنت وإعادة المحاولة",
        getData:
          "تعذر جلب البيانات من الخادم, يرجى الاتصال بالإنترنت وإعادة المحاولة",
        share: "لا يدعم المتصفح المشاركة أو النسخ",

        cache: {
          support: "المتصفح لا يدعم التخزين المؤقت!",
          found:
            "لا يوجد تخزين مؤقت لهذه الصفحة, يرجى الاتصال بالإنترنت وإعادة المحاولة",
          put: "تعذر تخزين البيانات لهذه الصفحة, يرجى الاتصال بالإنترنت وإعادة المحاولة",
          open: "تعذر فتح التخزين المؤقت لهذه الصفحة, يرجى الاتصال بالإنترنت وإعادة المحاولة",
          match:"تعذر البحث عن التخزين المؤقت لهذه الصفحة, يرجى الاتصال بالإنترنت وإعادة المحاولة",
        },
        proces : "حدثت خطأ في العملية, يرجى الاتصال بالإنترنت وإعادة المحاولة"
      },
      share: {
        linkCopied: "تم نسخ الرابط",
      },
    },
    loading: {
      more: "تحميل المزيد",
      wait: "يرجى الأنتظار...",
    },
    yes: "نعم",
    no: "لا",
    needInternet: "بحاجة للإنترنت!",
    and : "و"
  },
  pages: {
    prefs: {
      title: "التفضيلات",
      boxs: {
        lang: "تغيير اللغة",
        dark: "الوضع المظلم",
      },
      autoLang: "تلقائي (حسب لغة المتصفح)",
    },
    start: {
      title: "هَيَّا بِنَا",
      error: {
        limit: `لا يمكنك انشاء {type} لقد تم تعدي الحد وهو  {limit} لإنشاء قائمة جديد , قم بحذف {type} لا تحتاجها.`,
      },
      elements: {
        title: "اختر نوع المهًمّة",
        catg: {
          course: "دورة",
          board: "لوحة مهام",
        },
      },
      typeStart: {
        course: {
          nameCourse: {
            title: "اسم الدورة",
            input: "البرمجة",
            error: "يرجى كتابة اسم الدورة (20 حرفاً بحد أقصى)",
          },
          lessons: {
            title: "الدروس",
            input: "اسم الدرس هنا...",
            error: "لا يمكن ترك أي حقل فارغاَ (50 حرفاً بحد أقصى)",
            comment: [
              "يمكنك إضافة الدروس بالضغط هنا",
              "او لصق النص في أي خانة أو من خلال أزرار لوحة المفاتيح",
            ],
            popup: {
              title: "إضافة الدروس",
              numberLes: {
                label: "عدد الدروس",
                comment: "سوف يتم إضافة عدد هذه الدروس في خانة الدروس",
              },
              customWord: {
                label: "تخصيص الكلمة",
                comment:
                  'سوف يعد الدروس على حسب هذه الكلمة كمثال "الدرس (1)" تخصيص هذه الكلمة لكلمة اخرى',
              },
              errors: {
                numberLes: [
                  "يرجى التحقق من عدد الدروس, بحد اقصى",
                  "يمكنك إضافة",
                ],
                limit: `تم الوصول الى الحد {limit} درس, لا يمكنك اضافة دروس اضافية`,
                word: "لا يمكن تعدي 40 حرف",
              },
            },
          },
          done: {
            title: "الإنجاز",
            days: {
              label: "بكم يوم تريد أن تنجزها؟",
              error: "يرجى التحقق من عدد الأيام, اقصى مدة هي",
            },
            weekend: {
              added: "تعويض ايام الاجازة بأيام إضافية",
              label: "إجازة؟",
              error: {
                full: "لا يمكن أن يكون كل الأسبوع إجازة!",
                short: `تريد التعلم خلال {days} أيام, وأيام الاجازة {weekend} متى سوف تتعلم؟`,
              },
            },
            result: {
              text: [
                "كل يوم",
                "بإذن الله بعد",
                "أنجزها",
                "أو عطلة",
                "عدة ساعات",
              ],
            },
          },
          summary: {
            title: "ملخص",
            text: [
              "سوف أبدأ دورة",
              "يوجد فيها حاليا",
              " وأتعلم يومياً, ",
              "ما عدا يوم",
              ", وبعد",
              "الموافق تاريخ",
              "أتم هذه الدورة بإذن الله",
            ],
            and: "و",
          },
          createMsg: "تم إنشاء الدورة بنجاح!",
        },
        board: {
          nameBoard: {
            title: "اسم لوحة المهام",
            input: "مشروعي الجديد",
            error: " يرجى كتابة اسم لوحة المهام (20 حرفاً بحد أقصى)",
          },
          createMsg: "تم إنشاء لوحة المهام بنجاح!",
        },
        comp: {
          image: {
            size: "2 ميقابايت بحد اقصى",
            unselect: "لم يتم اختيار اي صورة",
            error: {
              big: "حجم الصورة كبير , اكبر عرض هو 5000x5000",
              small: "حجم الصورة صغير, اصغر عرض 50X92",
              type: "يرجى التأكد من حجم الصورة او نوعها",
            },
          },
        },
      },
    },
    index: {
      firstSect: {
        title: "دعنا نقوم بإنجاز شيء ما...ابدأ الآن",
        smallWord: "اِنْطَلَقَ! 🚀",
        comment:
          "الموضوع بسيط. 1.أضف دروس الدورة التي تريد تعلمها, 2.حدد عدد الأيام التي تريد انجاز الدورة بها. وهو يقوم بعمل جدول لك لإنجاز هذه الدورة خلال المدة التي حددتها! ,موقعــ لتخطيط الدورات وانجازها و تقييم انجاز الدورة",
        buttons: {
          signup: "سجل الآن!",
          dashboard : "لوحة التحكم",
          example: "مثال",
        },
      },
      features: {
        noAds: {
          title: "بلا إعلانات",
          comment: "استمتع بلا إعلانات مزعجة, وركز على دوراتك.",
        },
        feedbacks: {
          title: "يقيم الإنجاز",
          comment:
            "يقيم نسبة الانجاز من 5 تقيمات مختلفة , ويظهر نسبة إنجازك في الدورة.",
          eval: ["ممتاز", "جيد جدًا", "جيد", "سيئ", "سيئ جداً"],
        },
        free: {
          title: "مجاني",
          comment: "جميع هذه المميزات وغيرها  حالياً مجانية تماماً.",
        },
        multi: {
          title: "متعدد",
          comment:
            "يمكنك إنشاء أكثر من دورة والعمل عليها بفس الوقت بدون أي مشاكل.",
          image: [
            {
              title: "التصميم الجرافيكي",
              date: "(8 أيام)",
            },
            {
              title: "دورة PHP",
              date: "(20 يوم)",
            },
            {
              title: "الذكاء العاطفي",
              date: "(3 أيام)",
            },
          ],
        },
      },
      otherFeat: {
        title: "مميزات أخرى",
        elements: [
          "اختيار ايام اجازة",
          "متعدد اللغات",
          "اضافة دروس للدورة",
          "خاصية PWA",
          "مهام أو دورة",
          "يعطيك دروس اليوم",
          "مشاركة دوراتك",
          "الوضع المظلم",
          "كتابة الملاحظات",
        ],
      },
      register: {
        title: "سجل الآن",
        comment:
          "أبدا بتعلم المهارات التي لا طالما أردت اتقنها , أو وضع مهام تريد إنجازها.. هيا بنا.",
      },
    },
    dashboard: {
      active: {
        course: {
          title: "الدورات النشطة",
          notFound: {
            title: "لا يوجد دورات لديك!",
            comment: ["هل تريد البدء بـ", "دورة جديدة"],
          },
        },
        board: {
          title: "لوحات المهام النشطة",
          sub: "لوحة فرعية",
          task: "مهًمّة",
          taskLeft: "مهًمّة متبقي",
          notFound: {
            title: "لا يوجد قوائم مهام لديك!",
            comment: ["هل تريد البدء بـ", "قائمة مهام جديدة"],
          },
        },
        daysLeft: {
          late: "متأخر أكثر من -9999",
          early: "باقي أكثر من +9999",
        },
      },
      boards: {
        title: "لوحات المهام",
        sub: "لوحة فرعية",
        task: "مهًمّة",
        taskLeft: "مهًمّة متبقي",
        notFound: {
          title: "لا يوجد قوائم مهام لديك!",
          comment: ["هل تريد البدء بـ", "قائمة مهام جديدة"],
        },
        filter: {
          title: "تصفية",
          sort: {
            title: "الترتيب",
            oldToNew: "من الأقدم إلى الأحدث",
            newToOld: "من الأحدث إلى الأقدم",
            lastActive: "التفاعل الأخير",
            rate: "نسبة التقدم",
          },
          type: {
            title: "النوع",
            done: "منجز",
            notDone: "غير منجز",
          },
        },
        daysLeft: {
          late: "متأخر أكثر من -9999",
          early: "باقي أكثر من +9999",
        },
        list: {
          public: "تعيين على عام",
          private: "تعيين على خاص",
          share: "مشاركة",
          remove: "حذف",
        },
        msg: {
          status: {
            sure: {
              text: ["هل أنت متأكد من تعديل خصوصية لوحة المهام", "إلى"],
              private:
                "(لوحة خاصة), سوف تصبح هذه اللوحة خاصة بك فقط ولن يطّلع عليها إلا أنت.",
              public:
                "(لوحة عامة), سوف تظهر هذه اللوحة في حسابك ويمكن لأي شخص لديه الرابط مشاهدتها لوحتك ونسخها.",
            },
            set: {
              text: "تم تغيير حالة الخصوصية إلى",
              private: "لوحة مهام خاصة",
              public: "لوحة مهام عامة",
            },
          },
          remove: {
            sure: ["هل أنت متأكد من حذف لوحة المهام", "؟"],
            set: "تم حذف لوحة المهام بنجاح",
          },
        },
      },
      course: {
        title: "الدورات",
        notFound: {
          title: "لا يوجد دورات لديك!",
          comment: ["هل تريد البدء بـ", "دورة جديدة"],
        },
        filter: {
          title: "تصفية",
          sort: {
            title: "الترتيب",
            oldToNew: "من الأقدم إلى الأحدث",
            newToOld: "من الأحدث إلى الأقدم",
            lastActive: "التفاعل الأخير",
            rate: "نسبة التقدم",
          },
          type: {
            title: "النوع",
            done: "منجز",
            notDone: "غير منجز",
          },
        },
        daysLeft: {
          late: "متأخر أكثر من -9999",
          early: "باقي أكثر من +9999",
        },

        list: {
          public: "تعيين على عام",
          private: "تعيين على خاص",
          share: "مشاركة",
          remove: "حذف",
        },
        msg: {
          status: {
            sure: {
              text: ["هل أنت متأكد من تعديل خصوصية دورة", "إلى"],
              private:
                "(دورة خاصة), سوف تصبح هذه الدورة خاصة بك فقط ولن يطّلع عليها إلا أنت.",
              public:
                "(دورة عامة), سوف تظهر هذه الدورة في حسابك ويمكن لأي شخص لديه الرابط مشاهدة لوحتك ونسخها.",
            },
            set: {
              text: "تم تغيير حالة الخصوصية إلى",
              private: "دورة خاصة",
              public: "دورة عامة",
            },
            remove: {
              sure: ["هل أنت متأكد من حذف دورة", "؟"],
              set: "تم حذف الدورة بنجاح",
            },
          },
        },
      },
    },

    course: {
      all: {
        title: "جميع الدروس",
        btn: "إضافة دروس جديدة",
        note: "الدفتر",
        pop: {
          lesson: {
            add: {
              title: "إضافة الدروس",
              numberLes: {
                label: "عدد الدروس",
                comment: "سوف تتم إضافة عدد هذه الدروس في خانة الدروس المضافة",
              },
              customWord: {
                label: "تخصيص الكلمة",
                comment:
                  'سوف يعد الدروس على حسب هذه الكلمة كمثال "الدرس (1)" تخصيص هذه الكلمة لكلمة أخرى',
              },
              btn: "إضافة الدروس",
              addedLes: {
                title: "الدروس المضافة",
                comment:
                  "يمكنك إضافة الدروس من خلال الزر في الأعلى أو لصق النص في أي خانة أو من خلال أزرار لوحة المفاتيح",
                placeholder: "اسم الدرس هنا...",
              },
              errors: {
                numberLes: [
                  "يرجى التحقق من عدد الدروس, بحد اقصى",
                  "يمكنك إضافة",
                ],
                limit : `تم الوصول الى الحد {limit}, لا يمكنك اضافة دروس اضافية`,
                word: "لا يمكن تعدي 40 حرف",
                addedLes: "لا يمكن ترك أي حقل فارغاَ (50 حرفاً بحد أقصى)",
              },
            },
            note: {
              doneIn: "تم في",
              options: {
                rename: "إعادة التسمية",
                move: "نقل",
                copy: "نسخ",
                remove: "حذف",
              },
            },
            move: {
              title: "نقل",
              before: "قبل",
              after: "بعد",
              oneLesson: "لا يوجد إلا درس واحد",
              error : "لا يمكن نقل درس منجز الى تاريخ مستقبلي, تم انجاز الدرس"
            },
          },
        },
        msg: {
          add: "تم إضافة الدروس بنجاح",
          wait: "يرجى الأنتظار لم يتم إرسال بيانات التعديل الأخير",
          remove: {
            sure: ["هل أنت متأكد من حذف الدرس", "الدرس", "؟"],
            done: "تم حذف الدرس بنجاح",
          },
          move: {
            sure: ["هل أنت متأكد من نقل الدرس", "؟"],
            done: "تم نقل الدرس بنجاح",
          },
          copy: {
            sure: ["هل أنت متأكد من نسخ الدرس", "؟"],
            done: "تم نسخ الدرس بنجاح",
          },
          // !!!
          rename: {
            error:
              "حجم طول الدرس كبير ,بحد أقصى 50 حرف, هل تريد نسخ النص السابق؟",
            done: "تم تغير اسم الدرس بنجاح",
          },
          note : `لم يتم تخزين اخر تعديل , مساحة النص كبيرة, لا يمكن تعدي مساحة {limit} بايت, المساحة الان {size} بايت`,
        },
        cache: {
          save: "تعذر تخزين البيانات الجديدة لصفحة دروس اليوم, يرجى الاتصال بالإنترنت وإعادة المحاولة",
          opne: "تعذر فتح التخزين المؤقت لصفحة دروس اليوم, يرجى الاتصال بالإنترنت وإعادة المحاولة",
          match:
            "تعذر البحث عن التخزين المؤقت لصفحة دروس اليوم, يرجى الاتصال بالإنترنت وإعادة المحاولة",
        },
        copyWord: " - نسخة",
      },
      settings: {
        title: "إعدادات الدورة",
        nameCourse: {
          title: "تعديل اسم الدورة",
          error: "يرجى كتابة اسم الدورة (20 حرفاً بحد أقصى)",
        },
        notifs: {
          title : "استلام إشعارات عن الدورة",
          error : "لا يمكنك فتح الإشعارات, بسبب إعدادات الحساب, لكي تقوم بتفعيل الإشعارات قم بتعديل اعدادات ارسال رسائل البريد الإلكتروني"
        },
        deleteCourse: {
          title: "حذف الدورة",
          sure: "هل أنت متأكد من حذف الدورة؟",
        },
        done_days : {
          limit :  `حد وضع الايام من بداية إنشاء الدورة هو`,
          title : {
            inSpace : "تعديل الأيام المتبقية للإنتهاء",
            outSpace : "تعديل أيام العمل المتبقية"
          },
          description : "هذه الايام المتبقية من دون ايام الاجازات"
        },
        weekend : {
          title : "تعديل ايام الاجازات ",
          error : "لم يبقى اي يوم للتعلم, قلل من عدد ايام الاجازات لترك مساحة للتعلم او قم بزيادة الأيام المتبقية للإنتهاء",
          limit : "لا يمكن وضع اكثر من 6 ايام إجازة"
        },
        redist : {
          title : "إعادة ترتيب التأخير",
          description : "تفيد هذه الميزة بإعادة تعيين الدروس المتأخرة , ليصبح كأنك بدأت اليوم بهذه الدروس...سوف يتم اعادة ترتيب جميع الدروس.",
          sure : "هل أنت متأكد من إعادة ترتيب الدروس جميعها؟, سوف يتم إعادة ضبط نسبة التقدم",
          done : "تمت إعادة ترتيب الدروس المتأخرة بنجاح!"
        },
        image : {
          title : "تغيير الصورة",
          info : "2 ميقابايت بحد اقصى, مقاس 230x125 صيغة",
          done : "تم تغير الصورة بنجاح!!",
          error : {
            cant : "تعذر تغيير الصورة , يرجى إعادة المحاولة",
            type : "لا يمكن اختيار هذا الملف بسبب الصيغة او المساحة",
            big : "حجم الصورة كبير , اكبر عرض هو 5000x5000",
            small : "حجم الصورة صغير, اصغر عرض 50X92"
          }
        },
        private: {
          sure: "هل أنت متأكد من تعديل خصوصية الدورة إلى",
          privateCourse: "دورة خاصة",
          publicCourse: "دورة عامة",
          private: "خاصة",
          public: "عامة",
          privateComment:
            ", سوف تصبح هذه الدورة خاصة بك فقط ولن يطّلع عليها إلا أنت",
          publicComment:
            " , سوف تظهر هذه الدورة في حسابك ويمكن لأي شخص لديه الرابط مشاهدة لوحتك ونسخها",
        },
      },
      stats: {
        title: "إحصائيات الدورة",
      },
      today: {
        title: "دروس اليوم",
        doneBox: {
          title: "أنجزت دورس اليوم",
          btn: "إضافة درس جديد لليوم",
        },
        noLessonsBox: {
          title: "لا يوجد دروس اليوم",
          comment: ["يجدر بك الاستراحة قليلاًُ أو", "إضافة درس جديد لليوم"],
        },
        newLes: "🚀 درس جديد",
        lateLes: "متأخر",
        note: "الدفتر",
        msg: {
          wait: "يرجى الأنتظار لم يتم إرسال بيانات التعديل الأخير",
          note : `لم يتم تخزين اخر تعديل , مساحة النص كبيرة, لا يمكن تعدي مساحة {limit} بايت, المساحة الان {size} بايت`,
        },
        cache: {
          save: "تعذر تخزين البيانات الجديدة لصفحة جميع الدروس, يرجى الاتصال بالإنترنت وإعادة المحاولة",
          opne: "تعذر فتح التخزين المؤقت لصفحة جميع الدروس, يرجى الاتصال بالإنترنت وإعادة المحاولة",
          match:
            "تعذر البحث عن التخزين المؤقت لصفحة جميع الدروس, يرجى الاتصال بالإنترنت وإعادة المحاولة",
        },
      },
      finish: {
        title: "النهاية",
        box: {
          text: [
            "بفضل الله , أنجزت دورة",
            "أحسنت! .. إلى هنا نقول لك وداعا .. بذلت مجهوداً رائعا .. نشكرك على ذلك و بالتوفيق بإذن الله..",
          ],
          stats: {
            start: "بداية الدورة",
            end: "نهاية الدورة",
            exp: "التاريخ المتوقع",
            earlyWith: "متقدم بـ",
            left: "الأيام المستغرقة",
            early: "متقدم",
            late: "متأخر",
            lessons: "الدروس",
          },
          share: {
            title: "شارك",
            navigator: "مشاركة الدورة",
            whatsapp: "واتساب",
            twitter: "تويتر",
            telegram: "تيلقرام",
            facebook: "فيسبوك (رابط الموقع فقط)",
            more: "أخرى",
            copy: "نسخ",
            error: "عذراً يبدو أن هذه الميزة غير متاحة على هذا المتصفح",
          },
          shareText: `بفضل الله , أنجزت دورة

          ~~~~ %%% ~~~~
          أحسنت! .. بذلت مجهوداً رائعا ..

          الإحصائيات :

          بداية الدورة : %%%
          نهاية الدورة : %%%
          الأيام المستغرقة : %%%
          الدروس : %%%

          بواسطة %%% إحدى منتجات %%%
          %%%
          `,
          copy: "تم نسخ النص بنجاح",
        },
      },
      cant: "نعتذر منك لا تسطيع تعديل الدرس حاليا, يرجى الاتصال بالإنترنت وإعادة المحاولة.",
    },
    profile: {
      courses: "الدورات",
      boards: {
        title: "لوحات المهام",
        sub: "لوحة فرعية",
        task: "مهًمّة",
        taskLeft: "مهًمّة متبقي",
      },
      private: {
        course: {
          title: "الدورات خاصة",
          comment: "لا يوجد دورات متاحه للعامة",
        },
        boards: {
          title: "لوحات المهام خاصة",
          comment: "لا يوجد لوحات مهام متاحة للعامة",
        },
      },
      error: "هذه المستخدم غير موجود",
    },
    read: {
      title: "اقرأ",
      found: "عذرًا لا يوجد شيء حالياً",
    },
    install: {
      title: "تَثْبِيتٌ",
      pc: {
        title: "كمبيوتر",
        text: [
          "في خانة البحث توجد علامة في اليسار (تثبيت)",
          "قم بالضغط عليها",
          "* أيقونة التثبيت ليست مثل شكل هذه الأيقونة فقط للتوضيح",
        ],
      },
      android: {
        title: "أندرويد",
        text: [
          "بجانب خانة البحث توجد علامة",
          "(الثلاث نقاط) , قم بالضغط عليها , ستظهر لك قائمة من الخيارات اختر (تثبيت التطبيق) , بعدها اضغط تثبيت",
          "* أيقونة التثبيت ليست مثل شكل هذه الأيقونة فقط للتوضيح",
        ],
      },
      iphone: {
        title: "ايفون",
        text: [
          "في متصفح سفاري توجد أيقونة في الأسفل (مشاركة) , قم بالضغط عليها سوف تظهر العديد من الخيارات اختر منها (إضافة إلى الشاشة الرئيسية) ,  في الجانب الأيسر العلوي تجد زر (إضافة) قم بالضغط علية",
        ],
      },
    },
    update: {
      title: "التحديثات",
      current: "التحديث الحالي",
      added: "الإضافات",
      removed: "الإزالة",
      found: "عذرًا لا يوجد شيء حالياً",
    },
    about: {
      title: "حول",
      description:"مرحبا بك., 'نشِط' هو موقع لمتابعة تعلم الدورات و تقدمها, ويوفر ايضا ميزة انشاء لوحات المهام.",
      share: "تابع موقع جُزر على شبكات التواصل الاجتماعي",
      report:
        "للإبلاغ عن المشاكل او الاقتراحات يرجى التواصل معنى أو مراسلتنا على شبكات التواصل الاجتماعي.",
    },
    board: {
      index: {
        options: {
          details: "التفاصيل",
          rename: "إعادة تسمية",
          copy: "نسخ",
          delete: "حذف",
          move: "نقل",
        },
        tasksPlaceholder: "المهًمّة هي...",
        pops: {
          todoList: {
            details: {
              title: "التفاصيل",
              name: "اسم قائمة المهام",
              create: "تم إنشاء قائمة المهام في",
              lastUpdate: "آخر تحديث على قائمة المهام",
            },
            create: {
              title: "إنشاء قائمة مهام",
              name: "اسم قائمة المهام",
              error: "يكون الاسم بين 1 - 20 حرف",
            },
            rename: {
              title: "إعادة تسمية",
              name: "اسم قائمة المهام",
              error: "يكون الاسم بين 1 - 20 حرف",
            },
            copy: {
              title: "نسخ قائمة المهام",
              withTasks: "مع المهام",
              withoutTasks: "من دون المهام",
            },
          },
          task: {
            details: {
              title: "التفاصيل",
              name: "اسم المهًمّة",
              done: "تم إنجاز المهًمّة في",
              create: "تم إنشاء المهًمّة في",
              lastUpdate: "آخر تحديث على المهًمّة في",
            },
            move: {
              title: "نقل",
              to: ["نقل المهًمّة", "إلى"],
              noTodoLists: "لا يوجد قوائم مهام أخرى يمكنك نقل المهًمّة لها.",
            },
          },
        },
        msg: {
          wait: "يرجى الأنتظار لم يتم إرسال بيانات التعديل الأخير",
          todoList: {
            delete: {
              sure: "هل أنت متأكد من رغبتك في حذف قائمة مهام؟",
              one: "قائمة مهام واحدة على الأقل.",
              done: "تم حذف قائمة المهام بنجاح",
              error:
                "نعتذر منك لا تسطيع حذف قائمة المهام حاليا, يرجى الاتصال بالإنترنت وإعادة المحاولة.",
            },
            copy: {
              done: "تم نسخ قائمة المهام بنجاح",
              error:
                "نعتذر منك لا تسطيع نسخ قائمة المهام حالياً, يرجى الاتصال بالإنترنت وإعادة المحاولة.",
            },

            create: {
              cant: "نعتذر منك لا تسطيع إنشاء قائمة مهام حالياً, يرجى الاتصال بالإنترنت وإعادة المحاولة.",
              limit: `لا يمكن انشاء قائمة جديدة, حد قوائم المهام هو`,
            },
            cant: "نعتذر منك لا تسطيع تعديل قائمة المهام حاليا, يرجى الاتصال بالإنترنت وإعادة المحاولة.",
          },
          task: {
            create: {
              limitLetters: "حجم طول المهًمّة كبير ,بحد أقصى 50 حرف",
              limitLength: `تم تعدي حد المهام`,
              error:
                "نعتذر منك لا تسطيع إنشاء مهًمّة حاليا, يرجى الاتصال بالإنترنت وإعادة المحاولة.",
            },
            change:
              "نعتذر منك لم يتم حفظ مكان المهًمّة الجديد حاليا ,عند تحديث الصفحة سوف تعود مكانها, يرجى الاتصال بالإنترنت وإعادة المحاولة.",
            copy: {
              done: "تم نسخ المهًمّة بنجاح",
              error:
                "نعتذر منك لا تسطيع نسخ المهًمّة حاليا, يرجى الاتصال بالإنترنت وإعادة المحاولة.",
            },
            rename: {
              error:
                "حجم طول المهًمّة كبير ,بحد أقصى 50 حرف, هل تريد نسخ النص السابق؟",
              done: "تم تغير اسم المهًمّة بنجاح",
            },
            delete: {
              sure: "هل أنت متأكد من حذف المهًمّة؟",
              done: "تم حذف المهًمّة بنجاح",
              error:
                "نعتذر منك لا تسطيع حذف المهًمّة حالياً, يرجى الاتصال بالإنترنت وإعادة المحاولة.",
            },
            move: {
              sure: ["هل أنت متأكد من رغبتك في نقل المهًمّة", "إلى قائمة مهام"],
              error:
                "نعتذر منك لا تسطيع نقل المهًمّة حالياً, يرجى الاتصال بالإنترنت وإعادة المحاولة.",
            },
            note : `لم يتم تخزين اخر تعديل , مساحة النص كبيرة, لا يمكن تعدي مساحة {limit} بايت, المساحة الان {size} بايت`,
            cant: "نعتذر منك لا تسطيع تعديل المهًمّة حاليا, يرجى الاتصال بالإنترنت وإعادة المحاولة.",
          },
        },
        copied: " - نسخة",
      },
      settings: {
        title: "إعدادات اللوحة",
        nameBoard: {
          title: "تعديل اسم اللوحة",
          error: "يرجى كتابة اسم اللوحة (20 حرفاً بحد أقصى)",
        },
        notifs: {
          title : "استلام إشعارات عن هذه اللوحة",
          error : "لا يمكنك فتح الإشعارات, بسبب إعدادات الحساب, لكي تقوم بتفعيل الإشعارات قم بتعديل اعدادات ارسال رسائل البريد الإلكتروني"
        },
        deleteBoard: {
          title: "حذف اللوحة",
          sure: "هل أنت متأكد من حذف اللوحة بالكامل؟",
        },
        image : {
          title : "تغيير الصورة",
          info : "2 ميقابايت بحد اقصى, مقاس 230x100 صيغة",
          done : "تم تغير الصورة بنجاح!!",
          error : {
            cant : "تعذر تغيير الصورة , يرجى إعادة المحاولة",
            type : "لا يمكن اختيار هذا الملف بسبب الصيغة او المساحة",
            big : "حجم الصورة كبير , اكبر عرض هو 5000x5000",
            small : "حجم الصورة صغير, اصغر عرض 50X115"
          }
        },
        private: {
          sure: "هل أنت متأكد من تعديل خصوصية اللوحة إلى",
          privateBoard: "لوحة خاصة",
          publicBoard: "لوحة عامة",
          private: "خاصة",
          public: "عامة",
          privateComment:
            ", سوف تصبح هذه اللوحة خاصة بك فقط ولن يطّلع عليها إلا أنت",
          publicComment:
            " , سوف تظهر هذه اللوحة في حسابك ويمكن لأي شخص لديه الرابط مشاهدة لوحتك ونسخها",
        },
      },
      stats: {
        title: "إحصائيات اللوحة",
      },
    },
    registration: {
      text: "مرحبا بك  {name} , نتمنى لك تجربة ممتعة في هذه الجزيرة!! , هذا المشروع اخذ وقتاً طويلاً , نقدر وجودك هنا  اليوم, يوماً سعيداً.",
      go: "هيا بنا",
    },
  },
  components: {
    pageItems: {
      rate: {
        eval: [
          "ممتاز",
          "جيد جدا",
          "جيد",
          "سيئ",
          "سيئ جدا",
          "منتهى",
        ],
        evalRatio: {
          early: "متقدم",
          late: "متأخر",
        },
      },
    },
    footerApp: {
      anas : ["تم التطوير من قبل", "anas.repo"],
      about: {
        text: "الموضوع بسيط. 1.أضف دروس الدورة التي تريد تعلمها, 2.حدد عدد الأيام التي تريد انجاز الدورة بها. وهو يقوم بعمل جدول لك لإنجاز هذه الدورة خلال المدة التي حددتها! ,موقعــ لتخطيط الدورات وانجازها و تقييم انجاز الدورة",
        from: "إحدى منتجات",
      },
      pages: {
        title: "الصفحات",
        signup: "تسجيل",
        login: "تسجيل الدخول",
        dashboard: "لوحة التحكم",
        createAccount: "إنشاء حساب",
        createCourse: "إنشاء دورة جديدة",
      },
      imp: {
        title: "هَام",
        pp: "سياسة الخصوصية",
        tc: "الشروط والأحكام",
        credits : "شُكُر"
      },
      plat: {
        title: "جُزر",
        website: "الموقع الإلكتروني",
        apps: "المنتجات",
      },
    },
    headerApp: {
      buttons: {
        login: "تسجيل الدخول",
        signup: "تسجيل",
      },
    },
    navUser: {
      logout:
        "توجد تغييرات أجريتها بلا إنترنت, عند تسجيل الخروج فلن يتم مزامنة البيانات, يرجى الاتصال بالإنترنت بعدها اعد تسجيل الخروج, هل تريد تسجيل الخروج على كل حال؟",
      list: {
        profile: "الملف الشخصي",
        dashboard: "لوحة التحكم",
        myAccount: "حسابي",
        logout: "تسجيل الخروج",
      },
    },
    noteBook: {
      placeholder: "أكتب شيئا...",
      labels: {
        normal: "عادي",
        title: "العنوان",
        big: "كبير",
        medium: "وسط",
        small: "صغير",
      },
      cant: "نعتذر منك لا تسطيع تعديل البيانات حالياً, يرجى الاتصال بالإنترنت وإعادة المحاولة.",
    },
    pop: {
      imageCrop: {
        customize: "تخصيص الصورة",
        select: "اختيار الصورة",
        alert: "تنبيه : سوف يتم رفع الصورة الى خوادمنا, بعدها يتم قصها",
      },
    },
  },
  layouts: {
    page: {
      buttons: {
        login: "تسجيل الدخول",
        register: "تسجيل",
      },
      course: {
        link: {
          finish: "نهاية الدورة",
          stats: "الإحصائيات",
          today: "دروس اليوم",
          all: "جميع الدروس",
          settings: "إعدادات الدورة",
        },
        buttons: {
          copy: "نسخ الدورة",
        },
        copy: {
          title: "نسخ الدورة",
          done: {
            title: "الإنجاز",
            days: {
              label: "بكم يوم تريد أن تنجزها؟",
              error: "يرجى التحقق من عدد الأيام, اقصى مدة هي",
            },
            weekend: {
              added: "تعويض ايام الاجازة بأيام إضافية",
              label: "إجازة؟",
              error: "لا يمكن أن يكون كل الأسبوع إجازة!",
            },
            result: {
              text: [
                "كل يوم",
                "بإذن الله بعد",
                "أنجزها",
                "أو عطلة",
                "عدة ساعات",
              ],
            },
            error: `تريد التعلم خلال {day} أيام, وأيام الاجازة {day} متى سوف تتعلم؟`,
          },
        },

        msg: {
          copy: {
            sure: ["هل أنت متأكد من رغبتك بنسخ دورة", "؟"],
          },
        },
      },
      board: {
        link: {
          stats: "الإحصائيات",
          board: "اللوحة",
          settings: "إعدادات اللوحة",
        },
        buttons: {
          copy: "نسخ اللوحة كاملة",
          create: "إنشاء قائمة مهام",
        },
        pops: {
          copy: {
            title: "نسخ اللوحة",
            button: "نسخ",
            withTasks: "مع المهام",
            withoutTasks: "من دون المهام",
          },
        },
        msg: {
          copy: {
            sure: ["هل أنت متأكد من رغبتك بنسخ لوحة", "؟"],
          },
          showCreateTodo: "لإنشاء قائمة مهام يجب ان تكون في صفحة 'اللوحة'",
        },
      },
      global: {
        title: "عام",
        link: {
          dashboard: "لوحة التحكم",
          main: "الرئيسية",
          prefs: "التفضيلات",
          install: "تثبيت",
          report: "إبلاغ",
          about: "حول",
          read: "اقرأ",
        },
        more: "المزيد",
        close: "إغلاق",

        buttons: {
          share: "مشاركة",
        },
      },
      noInternet:
        "يرجى الاتصال بالإنترنت قريباً لمزامنة البيانات, في حال انتهت الجلسة سوف تحذف البيانات",
    },
    dashboard: {
      title: "لوحة التحكم",
      list: {
        active: "نشطة",
        courses: "الدورات",
        boards: "لوحات المهام",
      },
      btn: "جديد",
    },
    error: {
      text: "عذراً هذه الصفحة غير موجودة, من الممكن أنه قد تم حذف هذه الصفحة, أو قم بالتأكد من عنوان الرابط",
      main: "الذهاب للرئيسية",
    },
  },
  plugins: {
    logout: {
      out: "جارٍ تسجيل الخروج",
      deletePrivateData: "تم حذف البيانات الخاصة بنجاح",
      errorDeletePrivateData:
        "حدثت مشكلة في حذف بيانات خاصة, سوف تتم إعادة تحميل الصفحة خلال 10 ثواني.",
      error : "تعذر تسجيل الخروج, يرجى إعادة المحاولة"
    },
    sync: {
      syncData: "جارٍ مزامنة البيانات",
      done: "تمت المزامنة بنجاح",
      error:
        "حدثت مشكلة في مزامنة البيانات المخزنة, سوف تتم إعادة تحميل الصفحة خلال 10 ثواني.",
    },
  },
  config: {
    title: "نشِط {'|'} جزيرة الإنجاز",
    names: {
      nashit: "نشِط {'|'} جزيرة الإنجاز",
      juzr: "Juzr {'|'} جُزر",
    },
  },
  utils : {
    $api : {
      many : "طلبات كثيرة يرجى اعادة المحاولة بعد دقيقة"
    }
  }
};
